nieaowei/newlab-stm32-driver/LCD模块/LCD驱动实验/LCD_TOUCH/USER/LCD/GLCD_MCBSTM32E.c
        wr_reg(0x02, x  >>    8);           /* Column address start MSB           */
        wr_reg(0x03, x  &  0xFF);           /* Column address start LSB           */
        wr_reg(0x04, xe >>    8);           /* Column address end MSB             */
        wr_reg(0x05, xe &  0xFF);           /* Column address end LSB             */

        wr_reg(0x06, y  >>    8);           /* Row address start MSB              */
        wr_reg(0x07, y  &  0xFF);           /* Row address start LSB              */
        wr_reg(0x08, ye >>    8);           /* Row address end MSB                */
        wr_reg(0x09, ye &  0xFF);           /* Row address end LSB                */
    }
    else {
#if (GLCD_SWAP_XY == 1)
        wr_reg(0x50, y);                    /* Vertical   GRAM Start Address      */
        wr_reg(0x51, y+h-1);                /* Vertical   GRAM End   Address (-1) */
        wr_reg(0x52, x);                    /* Horizontal GRAM Start Address      */
        wr_reg(0x53, x+w-1);                /* Horizontal GRAM End   Address (-1) */
        wr_reg(0x20, y);
        wr_reg(0x21, x);
#else
        wr_reg(0x50, x);                    /* Horizontal GRAM Start Address      */
        wr_reg(0x51, x+w-1);                /* Horizontal GRAM End   Address (-1) */
        wr_reg(0x52, y);                    /* Vertical   GRAM Start Address      */
        wr_reg(0x53, y+h-1);                /* Vertical   GRAM End   Address (-1) */
        wr_reg(0x20, x);
        wr_reg(0x21, y);
#endif
    }
}


/************************ Exported functions **********************************/

/**
  \fn          int32_t GLCD_Initialize (void)
  \brief       Initialize Graphic LCD
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_Initialize (void) {
    uint16_t driverCode;

#if (GLCD_SWAP_XY == 0)
    Scroll = 0;
#endif

    /* Configure the LCD Control pins --------------------------------------------*/
    LCD_CtrlLinesConfig();
    /* Configure the FSMC Parallel interface -------------------------------------*/
    LCD_FSMCConfig();

    delay_ms(50);                         /* Delay 50 ms                        */
    driverCode = rd_reg(0x00);
    printf("driverCode 0x%x \r\n",driverCode);
    if (driverCode == 0x47) {             /* LCD with HX8347-D LCD Controller   */
        Himax = 1;                          /* Set Himax LCD controller flag      */
        /* Driving ability settings ----------------------------------------------*/
        wr_reg(0xEA, 0x00);                 /* Power control internal used (1)    */
        wr_reg(0xEB, 0x20);                 /* Power control internal used (2)    */
        wr_reg(0xEC, 0x0C);                 /* Source control internal used (1)   */
        wr_reg(0xED, 0xC7);                 /* Source control internal used (2)   */
        wr_reg(0xE8, 0x38);                 /* Source output period Normal mode   */
        wr_reg(0xE9, 0x10);                 /* Source output period Idle mode     */
        wr_reg(0xF1, 0x01);                 /* RGB 18-bit interface ;0x0110       */
        wr_reg(0xF2, 0x10);

        /* Adjust the Gamma Curve ------------------------------------------------*/
        wr_reg(0x40, 0x01);
        wr_reg(0x41, 0x00);
        wr_reg(0x42, 0x00);
        wr_reg(0x43, 0x10);
        wr_reg(0x44, 0x0E);
        wr_reg(0x45, 0x24);
        wr_reg(0x46, 0x04);
        wr_reg(0x47, 0x50);
        wr_reg(0x48, 0x02);
        wr_reg(0x49, 0x13);
        wr_reg(0x4A, 0x19);
        wr_reg(0x4B, 0x19);
        wr_reg(0x4C, 0x16);

        wr_reg(0x50, 0x1B);
        wr_reg(0x51, 0x31);
        wr_reg(0x52, 0x2F);
        wr_reg(0x53, 0x3F);
        wr_reg(0x54, 0x3F);
        wr_reg(0x55, 0x3E);
        wr_reg(0x56, 0x2F);
        wr_reg(0x57, 0x7B);
        wr_reg(0x58, 0x09);
        wr_reg(0x59, 0x06);
        wr_reg(0x5A, 0x06);
        wr_reg(0x5B, 0x0C);
        wr_reg(0x5C, 0x1D);
        wr_reg(0x5D, 0xCC);

        /* Power voltage setting -------------------------------------------------*/
        wr_reg(0x1B, 0x1B);
        wr_reg(0x1A, 0x01);
        wr_reg(0x24, 0x2F);
        wr_reg(0x25, 0x57);
        wr_reg(0x23, 0x88);

        /* Power on setting ------------------------------------------------------*/
        wr_reg(0x18, 0x36);                 /* Internal oscillator frequency adj  */
        wr_reg(0x19, 0x01);                 /* Enable internal oscillator         */
        wr_reg(0x01, 0x00);                 /* Normal mode, no scrool             */
        wr_reg(0x1F, 0x88);                 /* Power control 6 - DDVDH Off        */
        delay_ms(200);
        wr_reg(0x1F, 0x82);                 /* Power control 6 - Step-up: 3 x VCI */
        delay_ms(50);
        wr_reg(0x1F, 0x92);                 /* Power control 6 - Step-up: On      */
        delay_ms(50);
        wr_reg(0x1F, 0xD2);                 /* Power control 6 - VCOML active     */
        delay_ms(50);

        /* Color selection -------------------------------------------------------*/
        wr_reg(0x17, 0x55);                 /* RGB, System interface: 16 Bit/Pixel*/
        wr_reg(0x00, 0x00);                 /* Scrolling off, no standby          */

        /* Interface config ------------------------------------------------------*/
        wr_reg(0x2F, 0x11);                 /* LCD Drive: 1-line inversion        */
        wr_reg(0x31, 0x00);
        wr_reg(0x32, 0x00);                 /* DPL=0, HSPL=0, VSPL=0, EPL=0       */

        /* Display on setting ----------------------------------------------------*/
        wr_reg(0x28, 0x38);                 /* PT(0,0) active, VGL/VGL            */
        delay_ms(200);
        wr_reg(0x28, 0x3C);                 /* Display active, VGL/VGL            */

        /* Miror and Swap                                                         */
        wr_reg (0x16, ((GLCD_MIRROR_Y << 7) |   /* MY                             */
                       (GLCD_MIRROR_X << 6) |   /* MX                             */
                       (GLCD_SWAP_XY  << 5) |   /* MV                             */
                       (0 << 4) |               /* ML                             */
                       (1 << 3)));              /* BGR                            */

        /* Display scrolling settings --------------------------------------------*/
        wr_reg(0x0E, 0x00);                 /* TFA MSB                            */
        wr_reg(0x0F, 0x00);                 /* TFA LSB                            */
        wr_reg(0x10, 320 >> 8);             /* VSA MSB                            */
        wr_reg(0x11, 320 &  0xFF);          /* VSA LSB                            */
        wr_reg(0x12, 0x00);                 /* BFA MSB                            */
        wr_reg(0x13, 0x00);                 /* BFA LSB                            */
    }
    else {
        Himax = 0;                          /* This is not Himax LCD controller   */
        /* Start Initial Sequence ------------------------------------------------*/
#if (GLCD_MIRROR_X)
        wr_reg(0x01, 0x0000);               /* Clear SS bit                       */
#else
        wr_reg(0x01, 0x0100);               /* Set SS bit                         */
#endif
        wr_reg(0x02, 0x0700);               /* Set 1 line inversion               */
        wr_reg(0x04, 0x0000);               /* Resize register                    */
        wr_reg(0x08, 0x0207);               /* 2 lines front, 7 back porch        */
        wr_reg(0x09, 0x0000);               /* Set non-disp area refresh cyc ISC  */
        wr_reg(0x0A, 0x0000);               /* FMARK function                     */
        wr_reg(0x0C, 0x0000);               /* RGB interface setting              */
        wr_reg(0x0D, 0x0000);               /* Frame marker Position              */
        wr_reg(0x0F, 0x0000);               /* RGB interface polarity             */

