nieaowei/newlab-stm32-driver/LCD模块/LCD驱动实验/LCD_TOUCH/USER/LCD/GLCD_MCBSTM32E.c
    return 0;
}

/**
  \fn          int32_t GLCD_SetForegroundColor (uint32_t color)
  \brief       Set foreground color
  \param[in]   color  Color value
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_SetForegroundColor (uint32_t color) {
    foreground_color = color;
    return 0;
}

/**
  \fn          int32_t GLCD_SetBackgroundColor (uint32_t color)
  \brief       Set background color
  \param[in]   color  Color value
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_SetBackgroundColor (uint32_t color) {
    background_color = color;
    return 0;
}

/**
  \fn          int32_t GLCD_ClearScreen (void)
  \brief       Clear screen (with active background color)
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_ClearScreen (void) {
    uint32_t i;

    GLCD_SetWindow(0, 0, GLCD_WIDTH, GLCD_HEIGHT);

    wr_cmd(0x22);
    wr_dat_start();
    for (i = 0; i < (GLCD_WIDTH * GLCD_HEIGHT); i++) {
        wr_dat_only(background_color);
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCD_SetFont (GLCD_FONT *font)
  \brief       Set active font
  \param[in]   font   Pointer to font structure
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_SetFont (GLCD_FONT *font) {
    active_font = font;
    return 0;
}

/**
  \fn          int32_t GLCD_DrawPixel (uint32_t x, uint32_t y)
  \brief       Draw pixel (in active foreground color)
  \param[in]   x  x position in pixels (0 = left corner)
  \param[in]   y  y position in pixels (0 = upper corner)
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawPixel (uint32_t x, uint32_t y) {

#if (GLCD_SWAP_XY == 0)
    y = (y + Scroll) % GLCD_HEIGHT;
#endif

    if (Himax) {
        wr_reg(0x02, x >>    8);            /* Column address start MSB           */
        wr_reg(0x03, x &  0xFF);            /* Column address start LSB           */
        wr_reg(0x04, x >>    8);            /* Column address end MSB             */
        wr_reg(0x05, x &  0xFF);            /* Column address end LSB             */

        wr_reg(0x06, y >>    8);            /* Row address start MSB              */
        wr_reg(0x07, y &  0xFF);            /* Row address start LSB              */
        wr_reg(0x08, y >>    8);            /* Row address end MSB                */
        wr_reg(0x09, y &  0xFF);            /* Row address end LSB                */
    }
    else {
#if (GLCD_SWAP_XY == 1)
        wr_reg(0x20, y);
        wr_reg(0x21, x);
#else
        wr_reg(0x20, x);
        wr_reg(0x21, y);
#endif
    }

    wr_cmd(0x22);
    wr_dat(foreground_color);

    return 0;
}

/**
  \fn          int32_t GLCD_DrawHLine (uint32_t x, uint32_t y, uint32_t length)
  \brief       Draw horizontal line (in active foreground color)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   length Line length
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawHLine (uint32_t x, uint32_t y, uint32_t length) {

#if (GLCD_SWAP_XY == 0)
    y = (y + Scroll) % GLCD_HEIGHT;
#endif

    GLCD_SetWindow(x, y, length, 1);
    wr_cmd(0x22);
    wr_dat_start();

    while (length--) {
        wr_dat_only(foreground_color);
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCD_DrawVLine (uint32_t x, uint32_t y, uint32_t length)
  \brief       Draw vertical line (in active foreground color)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   length Line length in pixels
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawVLine (uint32_t x, uint32_t y, uint32_t length) {

#if (GLCD_SWAP_XY == 0)
    y = (y + Scroll) % GLCD_HEIGHT;
#endif

    GLCD_SetWindow(x, y, 1, length);
    wr_cmd(0x22);
    wr_dat_start();

    while (length--) {
        wr_dat_only(foreground_color);
    }
    wr_dat_stop();

    return 0;
}

/**
  \fn          int32_t GLCD_DrawRectangle (uint32_t x, uint32_t y, uint32_t width, uint32_t height)
  \brief       Draw rectangle (in active foreground color)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   width  Rectangle width in pixels
  \param[in]   height Rectangle height in pixels
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawRectangle (uint32_t x, uint32_t y, uint32_t width, uint32_t height) {

    GLCD_DrawHLine (x,         y,          width);
    GLCD_DrawHLine (x,         y + height, width);
    GLCD_DrawVLine (x,         y,          height);
    GLCD_DrawVLine (x + width, y,          height);

    return 0;
}
/**
  \fn          int32_t GLCD_DrawFullRectangle (void)
  \brief       Draw full rectangle (in active background color)
  \param[in]   x      Start x position in pixels (0 = left corner)
  \param[in]   y      Start y position in pixels (0 = upper corner)
  \param[in]   width  Rectangle width in pixels
  \param[in]   height Rectangle height in pixels
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawFullRectangle (uint32_t x, uint32_t y, uint32_t width, uint32_t height) {
    uint32_t i;

    GLCD_SetWindow(x, y, width, height);

    wr_cmd(0x22);
    wr_dat_start();
    for (i = 0; i < (width * height); i++) {
        wr_dat_only(background_color);
    }
    wr_dat_stop();

    return 0;
}
/**
  \fn          int32_t GLCD_DrawChar (uint32_t x, uint32_t y, int32_t ch)
  \brief       Draw character (in active foreground color)
  \param[in]   x      x position in pixels (0 = left corner)
  \param[in]   y      y position in pixels (0 = upper corner)
  \param[in]   ch     Character
  \returns
   - \b  0: function succeeded
   - \b -1: function failed
*/
int32_t GLCD_DrawChar (uint32_t x, uint32_t y, int32_t ch) {
    uint32_t i, j;
    uint32_t wb;
    uint8_t *ptr_ch_bmp;

#if (GLCD_SWAP_XY == 0)
    y = (y + Scroll) % GLCD_HEIGHT;
#endif

    if (active_font == NULL) return -1;

